
## :white_check_mark: Apply Succeeded (user-list-search-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/41346)



<pre><code>Apply complete! Resources: 1 added, 7 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=eb3023edbeeebdfc480fc7b0d501bff94c63f5bf]
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.pagerduty_token: Reading...
data.aws_kms_alias.secrets_manager: Reading...
aws_sqs_queue.user_list_import_backfill_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListImportBackfill-Deadletter]
data.aws_iam_policy.aws_xray_write_only_access: Reading...
aws_cloudwatch_log_group.user_list_import_backfill_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-UserListImportBackfill]
aws_cloudwatch_log_group.elasticsearch_slow_index: Refreshing state... [id=/aws/aes/domains/userlistsearch-dev/slowindex]
aws_cloudwatch_log_group.elasticsearch_error: Refreshing state... [id=/aws/aes/domains/userlistsearch-dev/error]
aws_cloudwatch_log_group.xray: Refreshing state... [id=/ecs/UserListSearch/Dev/xray]
data.aws_caller_identity.current: Read complete after 0s [id=410318598490]
aws_cloudwatch_log_group.apollo_ecs: Refreshing state... [id=/ecs/UserListSearch/Dev/Apollo/node]
data.aws_kms_alias.secrets_manager: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_codedeploy_app.lambda_user_list_import_backfill: Refreshing state... [id=86de5fef-c9db-4402-aacf-523daee239a6:UserListSearch-Dev-UserListImportBackfill]
aws_cloudwatch_log_group.item_update_backfill_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-ItemUpdateBackfill]
aws_cloudwatch_log_group.item_update_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-ItemUpdate]
data.aws_ssm_parameter.vpc: Reading...
data.aws_ssm_parameter.sentry_dsn: Reading...
aws_sqs_queue.user_items_update_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsUpdate-Deadletter]
data.aws_ssm_parameter.pagerduty_token: Read complete after 0s [id=/Shared/PAGERDUTY_TOKEN]
aws_s3_bucket.synthetics_logs: Refreshing state... [id=userlistsearch-dev-syntheticlogs]
aws_sqs_queue.user_events_sns_topic_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-SNS-Topic-DLQ]
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/UserListSearch/Dev/SENTRY_DSN]
data.aws_ssm_parameter.vpc: Read complete after 0s [id=/Shared/Vpc]
data.aws_sns_topic.backend-deploy-topic: Reading...
data.aws_iam_policy_document.lambda_assume: Reading...
data.aws_iam_policy_document.codedeploy_assume_role: Reading...
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_acm_certificate.root_cert: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/f9abbc81-1c6b-46ca-b9a3-e6a482069180]
data.aws_iam_policy_document.elasticsearch_log_publishing: Reading...
data.aws_iam_policy_document.codedeploy_assume_role: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.elasticsearch_log_publishing: Read complete after 0s [id=2597252832]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/UserListSearch-Dev]
aws_sqs_queue.user_list_import_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListImport-Deadletter]
aws_codedeploy_app.lambda_item_update: Refreshing state... [id=367c7513-95ea-4129-b3e3-b36d828fcb50:UserListSearch-Dev-ItemUpdate]
data.aws_iam_policy.aws_xray_write_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess]
aws_codedeploy_app.lambda_item_delete: Refreshing state... [id=f9eb8654-ca27-4cb4-bfa3-8f757d84d256:UserListSearch-Dev-ItemDelete]
aws_codedeploy_app.lambda_user_list_import: Refreshing state... [id=6485bb2a-e768-4183-965f-1fe544702a27:UserListSearch-Dev-UserListImport]
aws_sqs_queue.user_items_update_backfill_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsUpdateBackfill-Deadletter]
data.aws_sns_topic.backend-deploy-topic: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_kinesis_stream.unified: Reading...
aws_cloudwatch_log_group.queue_users_ecs: Refreshing state... [id=/ecs/UserListSearch/Dev/QueueUsers/node]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_route53_zone.hosted_zone: Refreshing state... [id=Z0515377UPQ3OZ1QTXIQ]
aws_codedeploy_app.lambda_item_update_backfill: Refreshing state... [id=7ac6aa9e-795b-4668-af2b-629c9f2032f0:UserListSearch-Dev-ItemUpdateBackfill]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_sqs_queue.user_list_events_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListEvents-Deadletter]
aws_s3_bucket.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-dev-kinesis-consumer]
data.aws_kinesis_stream.unified: Read complete after 0s [id=arn:aws:kinesis:us-east-1:410318598490:stream/unified_event]
aws_cloudwatch_log_group.item_delete_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-ItemDelete]
aws_codedeploy_app.lambda_user_list_events: Refreshing state... [id=858687a2-f64b-4c45-96e1-fcc0b1235bba:UserListSearch-Dev-EventHandler]
aws_ecr_repository.ecr_repo: Refreshing state... [id=userlistsearch-dev]
aws_cloudwatch_log_group.elasticsearch_slow_query: Refreshing state... [id=/aws/aes/domains/userlistsearch-dev/slowquery]
aws_sqs_queue.user_items_delete_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsDelete-Deadletter]
aws_codedeploy_app.ecs_codedeploy_app: Refreshing state... [id=c846918a-bfdc-4dcd-ac02-c25956258661:UserListSearch-Dev]
aws_cloudwatch_log_group.user_list_import_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-UserListImport]
aws_cloudwatch_log_group.unified_events_consumer: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-UnifiedEventsConsumer]
aws_cloudwatch_log_group.user_list_events_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Dev-EventHandler]
data.aws_route53_zone.main_zone: Reading...
aws_codedeploy_app.lambda_unified_events_consumer: Refreshing state... [id=f279008e-abba-4dc2-ba73-d4ca49201693:UserListSearch-Dev-UnifiedEventsConsumer]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_sqs_queue.user_list_import_backfill: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListImportBackfill]
data.aws_vpc.vpc: Reading...
aws_iam_role.user_list_import_backfill_lambda_role: Refreshing state... [id=UserListSearch-Dev-UserListImportBackfillLambdaExecutionRole]
data.aws_route53_zone.main_zone: Read complete after 0s [id=ZCSIDA846KWLN]
aws_iam_role.syntethics: Refreshing state... [id=UserListSearch-Dev-CloudWatchSyntheticsRole]
aws_iam_role.lambda_role: Refreshing state... [id=UserListSearch-Dev-LambdaExecutionRole]
aws_iam_role.user_list_events_lambda_role: Refreshing state... [id=UserListSearch-Dev-UserListEventsLambdaExecutionRole]
aws_iam_role.item_update_backfill_lambda_role: Refreshing state... [id=UserListSearch-Dev-ItemUpdateBackfillLambdaExecutionRole]
aws_iam_role.item_delete_lambda_role: Refreshing state... [id=UserListSearch-Dev-ItemDeleteLambdaExecutionRole]
aws_iam_role.user_list_import_lambda_role: Refreshing state... [id=UserListSearch-Dev-UserListImportLambdaExecutionRole]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_iam_role.item_update_lambda_role: Refreshing state... [id=UserListSearch-Dev-ItemUpdateLambdaExecutionRole]
aws_sqs_queue.user_items_update: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsUpdate]
aws_iam_role.ecs_codedeploy_role: Refreshing state... [id=UserListSearch-Dev-ECSCodeDeployRole]
aws_iam_role.lambda_codedeploy_role: Refreshing state... [id=UserListSearch-Dev-LambdaCodeDeployRole]
aws_cloudwatch_log_resource_policy.elasticsearch_log_publishing: Refreshing state... [id=UserListSearch-Dev-AesLogPublish]
aws_sqs_queue.user_list_import: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListImport]
aws_sqs_queue.user_items_update_backfill: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsUpdateBackfill]
aws_iam_role.ecs_execution_role: Refreshing state... [id=UserListSearch-Dev-TaskExecutionRole]
aws_iam_role.ecs_task_role: Refreshing state... [id=UserListSearch-Dev-TaskRole]
aws_sqs_queue.user_list_events: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListEvents]
aws_sqs_queue.user_items_delete: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserItemsDelete]
data.aws_iam_policy_document.syntethics: Reading...
aws_route53_record.root_route53_record: Refreshing state... [id=Z0515377UPQ3OZ1QTXIQ__5f7da6030155c1d26bed41fd1ca7e3a6.user-list-search.getpocket.dev._CNAME]
data.aws_iam_policy_document.syntethics: Read complete after 0s [id=2430337925]
aws_codestarnotifications_notification_rule.lambda_user_list_import_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/63f95343cc43a1e73d802daaad0db61e6d343bbb]
aws_codestarnotifications_notification_rule.lambda_item_update_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/fae34935df3d6d1206a87740ec5d77354a9c3209]
aws_codestarnotifications_notification_rule.lambda_item_delete_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/c375cb8cd9a13cc33bce22bcc1bf16797a43e31f]
data.aws_iam_policy_document.ecs_task_execution_role_policy: Reading...
aws_codestarnotifications_notification_rule.lambda_user_list_import_backfill_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/4b5157d1d67da2ba57e29373701b66f56309f4ed]
data.aws_iam_policy_document.ecs_task_execution_role_policy: Read complete after 0s [id=3846617378]
aws_codestarnotifications_notification_rule.lambda_user_list_events_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/75a2c1dafa981767e91c1e53a376f151917e3f10]
aws_codestarnotifications_notification_rule.lambda_item_update_backfill_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/8914ebe862b2a009456b29423af800bc7851737b]
aws_ecr_lifecycle_policy.old_images_policy: Refreshing state... [id=userlistsearch-dev]
aws_codestarnotifications_notification_rule.apollo_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/16d9ff0dd6364e515ce8f8a4a133af81fc77b758]
aws_route53_record.hosted_zone_ns: Refreshing state... [id=ZCSIDA846KWLN_user-list-search.getpocket.dev._NS]
aws_codestarnotifications_notification_rule.lambda_unified_events_consumer_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/9d6d622d8015062b296ce36da6a5adf586e3ec56]
data.aws_vpc.vpc: Read complete after 1s
aws_s3_bucket_acl.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-dev-kinesis-consumer,private]
aws_s3_bucket_public_access_block.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-dev-kinesis-consumer]
aws_iam_role_policy_attachment.user_list_import_backfill_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-UserListImportBackfillLambdaExecutionRole-20211215183040238800000003]
aws_iam_role_policy_attachment.user_list_events_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-UserListEventsLambdaExecutionRole-20220513175420669400000001]
aws_iam_role_policy_attachment.item_update_backfill_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-ItemUpdateBackfillLambdaExecutionRole-2021121518304122870000000a]
aws_iam_role_policy_attachment.lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-LambdaExecutionRole-20211215183040504900000005]
aws_db_subnet_group.mysql_subnet[0]: Refreshing state... [id=userlistsearch-dev-mysql-subnet]
aws_iam_role_policy_attachment.item_delete_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-ItemDeleteLambdaExecutionRole-20211215183040999500000009]
data.aws_iam_policy_document.item_update_lambda_execution_policy: Reading...
aws_iam_role_policy_attachment.user_list_import_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-UserListImportLambdaExecutionRole-20211215183040403300000004]
data.aws_iam_policy_document.item_update_lambda_execution_policy: Read complete after 0s [id=3540020746]
aws_iam_role_policy_attachment.item_update_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Dev-ItemUpdateLambdaExecutionRole-20211215183040809600000006]
data.aws_iam_policy_document.user_list_import_backfill_lambda_execution_policy: Reading...
data.aws_iam_policy_document.item_update_backfill_lambda_execution_policy: Reading...
data.aws_iam_policy_document.item_update_backfill_lambda_execution_policy: Read complete after 0s [id=3862387413]
data.pagerduty_vendor.cloudwatch: Reading...
data.aws_iam_policy_document.user_list_import_backfill_lambda_execution_policy: Read complete after 0s [id=3862387413]
aws_iam_role_policy_attachment.ecs_codedeploy_role: Refreshing state... [id=UserListSearch-Dev-ECSCodeDeployRole-2021121518304255780000000c]
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
aws_iam_role_policy.syntethics: Refreshing state... [id=UserListSearch-Dev-CloudWatchSyntheticsRole:UserListSearch-Dev-CloudWatchSyntheticsPolicy]
data.aws_iam_policy_document.user_list_import_lambda_execution_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=947789742]
data.aws_iam_policy_document.user_list_import_lambda_execution_policy: Read complete after 0s [id=645129352]
aws_iam_role_policy_attachment.ecs_execution_role_xray_write: Refreshing state... [id=UserListSearch-Dev-TaskExecutionRole-20211215183040855400000007]
aws_codedeploy_deployment_group.lambda_user_list_import: Refreshing state... [id=844dbf88-4b10-4af9-b1a8-a39246d78879]
aws_codedeploy_deployment_group.lambda_unified_events_consumer: Refreshing state... [id=d4737fa1-c04c-43e3-84a3-5644778867e8]
aws_codedeploy_deployment_group.lambda_item_update_backfill: Refreshing state... [id=c1a850f5-d91d-4aca-bb17-084dd7077619]
aws_iam_role_policy_attachment.ecs_task_execution_default_attachment: Refreshing state... [id=UserListSearch-Dev-TaskExecutionRole-20211215183040907500000008]
aws_codedeploy_deployment_group.lambda_user_list_import_backfill: Refreshing state... [id=c897abdb-dd50-44f6-9a71-54611133a942]
aws_codedeploy_deployment_group.lambda_item_update: Refreshing state... [id=193ee370-3b42-4171-87c1-10cba0d33490]
aws_iam_role_policy_attachment.lambda_codedeploy_role: Refreshing state... [id=UserListSearch-Dev-LambdaCodeDeployRole-2021121518304245720000000b]
aws_codedeploy_deployment_group.lambda_user_list_events: Refreshing state... [id=f024e522-b25d-4ddc-a006-a95951d51750]
aws_codedeploy_deployment_group.lambda_item_delete: Refreshing state... [id=472af623-0533-43bd-9035-5ad2efc3fd1c]
data.aws_iam_policy_document.user_list_events_lambda_execution_policy: Reading...
data.aws_iam_policy_document.user_list_events_lambda_execution_policy: Read complete after 0s [id=2558215517]
data.aws_iam_policy_document.user_events_sns_topic_dlq_policy_document: Reading...
data.aws_iam_policy_document.item_delete_lambda_execution_policy: Reading...
data.aws_iam_policy_document.user_events_sns_topic_dlq_policy_document: Read complete after 0s [id=675443986]
data.aws_iam_policy_document.item_delete_lambda_execution_policy: Read complete after 0s [id=4145250487]
data.aws_iam_policy_document.user_events_sqs_policy_document: Reading...
aws_sns_topic_subscription.user_events_sns_topic_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:e8dde434-8e3c-4d5d-920b-7e1cc59b13cf]
data.aws_iam_policy_document.user_events_sqs_policy_document: Read complete after 0s [id=3638131325]
data.aws_iam_policy_document.lambda_execution_policy: Reading...
data.aws_iam_policy_document.lambda_execution_policy: Read complete after 0s [id=2960144195]
aws_iam_policy.ecs_task_execution_role_policy: Refreshing state... [id=arn:aws:iam::410318598490:policy/UserListSearch-Dev-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.ecs_task_role_xray_write: Refreshing state... [id=UserListSearch-Dev-TaskRole-20231211213748022400000001]
aws_acm_certificate_validation.root_cert_validation: Refreshing state... [id=2022-11-15 04:21:21 +0000 UTC]
aws_security_group.alb_security_group: Refreshing state... [id=sg-0425eff1ccda8af39]
aws_security_group.mysql[0]: Refreshing state... [id=sg-0cc7cfbf3ea9708aa]
aws_security_group.es: Refreshing state... [id=sg-07c6863b66a7fa004]
aws_iam_role_policy.item_update_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-ItemUpdateLambdaExecutionRole:UserListSearch-Dev-ItemUpdateAccessPolicy]
aws_iam_role_policy.item_update_backfill_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-ItemUpdateBackfillLambdaExecutionRole:UserListSearch-Dev-ItemUpdateBackfillAccessPolicy]
aws_iam_role_policy.user_list_import_backfill_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-UserListImportBackfillLambdaExecutionRole:UserListSearch-Dev-UserListImportBackfillAccessPolicy]
aws_iam_policy.ecs_task_role_policy: Refreshing state... [id=arn:aws:iam::410318598490:policy/UserListSearch-Dev-TaskRolePolicy]
data.pagerduty_vendor.cloudwatch: Read complete after 1s [id=PZQ6AUS]
aws_iam_role_policy.user_list_events_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-UserListEventsLambdaExecutionRole:UserListSearch-Dev-UserListEventsAccessPolicy]
aws_iam_role_policy.user_list_import_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-UserListImportLambdaExecutionRole:UserListSearch-Dev-UserListImportAccessPolicy]
aws_sqs_queue_policy.user_events_sns_topic_dlq_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-SNS-Topic-DLQ]
aws_iam_role_policy.item_delete_lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-ItemDeleteLambdaExecutionRole:UserListSearch-Dev-ItemDeleteAccessPolicy]
aws_sqs_queue_policy.user_events_sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/UserListSearch-Dev-UserListEvents]
aws_iam_role_policy.lambda_execution_policy: Refreshing state... [id=UserListSearch-Dev-LambdaExecutionRole:UserListSearch-Dev-KinesisEventAccessPolicy]
module.emergency_response.pagerduty_service.pagerduty["critical"]: Refreshing state... [id=P9R0CE6]
module.emergency_response.pagerduty_service.pagerduty["non-critical"]: Refreshing state... [id=P5ECC1G]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-07459d456a97892f5]
aws_iam_role_policy_attachment.ecs_task_execution_custom_attachment: Refreshing state... [id=UserListSearch-Dev-TaskExecutionRole-2021121518304422390000000d]
module.emergency_response.aws_sns_topic.topics["non-critical"]: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:UserListSearch-Dev-SNS-Non-Critical]
module.emergency_response.aws_sns_topic.topics["critical"]: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:UserListSearch-Dev-SNS-Critical]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/ULS2021121518304789460000000e/3d22ecc8b46c87f0]
aws_iam_role_policy_attachment.ecs_task_custom_attachment: Refreshing state... [id=UserListSearch-Dev-TaskRole-20211215183048841400000010]
aws_rds_cluster.mysql[0]: Refreshing state... [id=userlistsearch-dev-mysql]
aws_elasticsearch_domain.user_search[0]: Refreshing state... [id=arn:aws:es:us-east-1:410318598490:domain/userlistsearch-dev-v2]
module.emergency_response.pagerduty_service_integration.integrations[0]: Refreshing state... [id=PWREQC0]
module.emergency_response.pagerduty_service_integration.integrations[1]: Refreshing state... [id=PSFTPMA]
module.emergency_response.aws_sns_topic_subscription.pagerduty_subscriptions[1]: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:UserListSearch-Dev-SNS-Non-Critical:38de978b-4f0f-49c3-912a-021daa8e047d]
module.emergency_response.aws_sns_topic_subscription.pagerduty_subscriptions[0]: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:UserListSearch-Dev-SNS-Critical:92a5f9da-a742-45c7-9f3e-a4ab5d70baa3]
aws_alb_target_group.alb_target: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/UserListSearch-Dev-Blue/2e629e8e3a2117b6]
aws_alb_listener.listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ULS2021121518304789460000000e/3d22ecc8b46c87f0/b0cea357626cb9ac]
aws_alb_target_group.alb_target_green: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/UserListSearch-Dev-Green/a382e8aa9d1a1947]
aws_route53_record.root_A_record: Refreshing state... [id=Z0515377UPQ3OZ1QTXIQ__A_UserListSearch-Dev]
aws_lambda_function.item_update_sqs_processor: Refreshing state... [id=UserListSearch-Dev-ItemUpdate]
aws_lambda_function.unified_events_consumer: Refreshing state... [id=UserListSearch-Dev-UnifiedEventsConsumer]
aws_lambda_function.user_list_import_backfill_sqs_processor: Refreshing state... [id=UserListSearch-Dev-UserListImportBackfill]
aws_lambda_function.item_update_backfill_sqs_processor: Refreshing state... [id=UserListSearch-Dev-ItemUpdateBackfill]
aws_lambda_function.user_list_events_sqs_processor: Refreshing state... [id=UserListSearch-Dev-EventHandler]
aws_lambda_function.user_list_import_sqs_processor: Refreshing state... [id=UserListSearch-Dev-UserListImport]
aws_lambda_function.item_delete_sqs_processor: Refreshing state... [id=UserListSearch-Dev-ItemDelete]
aws_ecs_task_definition.queue_users: Refreshing state... [id=UserListSearch-Dev-QueueUsers]
aws_ecs_task_definition.apollo: Refreshing state... [id=UserListSearch-Dev-Apollo]
aws_alb_listener.listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ULS2021121518304789460000000e/3d22ecc8b46c87f0/7f40225896185300]
local_file.appspec: Refreshing state... [id=894297f73b7683c51231c76fcfd5c89f11203f72]
aws_lambda_alias.unified_events_consumer: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UnifiedEventsConsumer:DEPLOYED]
aws_lambda_alias.item_delete_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemDelete:DEPLOYED]
aws_lambda_alias.item_update_backfill_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdateBackfill:DEPLOYED]
aws_ecs_service.apollo: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/UserListSearch-Dev/Apollo]
aws_lambda_alias.user_list_import_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImport:DEPLOYED]
aws_lambda_alias.user_list_import_backfill_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImportBackfill:DEPLOYED]
aws_lambda_alias.item_update_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdate:DEPLOYED]
aws_lambda_alias.user_list_events_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-EventHandler:DEPLOYED]
aws_lambda_event_source_mapping.kinesis_consumer: Refreshing state... [id=10da9cb1-be10-4025-8ab3-ca8055668251]
aws_lambda_event_source_mapping.item_delete_sqs: Refreshing state... [id=dc45541d-d40c-4f12-8340-7921ae330883]
aws_lambda_event_source_mapping.item_update_backfill_sqs: Refreshing state... [id=3bca4e07-9190-43cb-bf8b-c546d4b31e9f]
aws_lambda_event_source_mapping.item_update_sqs: Refreshing state... [id=626c30e1-f15c-4c26-b45a-0db50b09de36]
aws_lambda_event_source_mapping.user_list_events_sqs: Refreshing state... [id=f1f49979-60b3-44b0-baf2-a8bdf751b069]
aws_lambda_event_source_mapping.user_list_import_backfill_sqs: Refreshing state... [id=621ee61b-8c66-4492-8ebe-ad0980a4d6d9]
aws_lambda_event_source_mapping.user_list_import_sqs: Refreshing state... [id=13f20536-0e7e-49c9-bf07-627578be7b4f]
aws_codedeploy_deployment_group.apollo_codedeploy_group: Refreshing state... [id=0eedbbb3-2677-48e8-adb1-ff9ac2d65aca]
module.dashboard_alarm.aws_cloudwatch_dashboard.dashboard["sla"]: Refreshing state... [id=UserListSearch-Dev]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["list_item_import_errors"]: Refreshing state... [id=UserListSearch-Dev-UserListImportErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["event_consumer_lambda_errors"]: Refreshing state... [id=UserListSearch-Dev-EventConsumerLambdaErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["list_item_update_errors"]: Refreshing state... [id=UserListSearch-Dev-UserItemUpdateErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["user_item_list_import_processing"]: Refreshing state... [id=UserListSearch-Dev-UserItemImportProcessingRate]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["alb_target_error_rate_critical"]: Refreshing state... [id=UserListSearch-Dev-ApolloALBTargetErrorRateCritical]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["user_item_list_update_processing"]: Refreshing state... [id=UserListSearch-Dev-UserItemListUpdateProcessingRate]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["elasticsearch_write_block"]: Refreshing state... [id=UserListSearch-Dev-ElasticSearchWriteBlockedCritical]
null_resource.apollo_update-task-definition: Refreshing state... [id=7753211878022648635]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.item_delete_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_delete_sqs_processor" {
        id                             = "UserListSearch-Dev-ItemDelete"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemDelete:53" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemDelete:53/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "53" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_backfill_sqs_processor" {
        id                             = "UserListSearch-Dev-ItemUpdateBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdateBackfill:72" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdateBackfill:72/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "72" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_sqs_processor" {
        id                             = "UserListSearch-Dev-ItemUpdate"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdate:75" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-ItemUpdate:75/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "75" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.unified_events_consumer will be updated in-place
  ~ resource "aws_lambda_function" "unified_events_consumer" {
        id                             = "UserListSearch-Dev-UnifiedEventsConsumer"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UnifiedEventsConsumer:144" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UnifiedEventsConsumer:144/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "144" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_events_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_events_sqs_processor" {
        id                             = "UserListSearch-Dev-EventHandler"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-EventHandler:28" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-EventHandler:28/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "28" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_backfill_sqs_processor" {
        id                             = "UserListSearch-Dev-UserListImportBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImportBackfill:71" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImportBackfill:71/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "71" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_sqs_processor" {
        id                             = "UserListSearch-Dev-UserListImport"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImport:72" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:UserListSearch-Dev-UserListImport:72/invocations" -> (known after apply)
      ~ runtime                        = "nodejs18.x" -> "nodejs20.x"
        tags                           = {
            "environment" = "Dev"
            "service"     = "UserListSearch"
        }
      ~ version                        = "72" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "node"
                                  + ContainerPort = 4000
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:410318598490:task-definition/UserListSearch-Dev-Apollo:97"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
local_file.appspec: Creating...
local_file.appspec: Creation complete after 0s [id=894297f73b7683c51231c76fcfd5c89f11203f72]
aws_lambda_function.unified_events_consumer: Modifying... [id=UserListSearch-Dev-UnifiedEventsConsumer]
aws_lambda_function.user_list_events_sqs_processor: Modifying... [id=UserListSearch-Dev-EventHandler]
aws_lambda_function.item_delete_sqs_processor: Modifying... [id=UserListSearch-Dev-ItemDelete]
aws_lambda_function.item_update_backfill_sqs_processor: Modifying... [id=UserListSearch-Dev-ItemUpdateBackfill]
aws_lambda_function.user_list_import_sqs_processor: Modifying... [id=UserListSearch-Dev-UserListImport]
aws_lambda_function.item_update_sqs_processor: Modifying... [id=UserListSearch-Dev-ItemUpdate]
aws_lambda_function.user_list_import_backfill_sqs_processor: Modifying... [id=UserListSearch-Dev-UserListImportBackfill]
aws_lambda_function.user_list_events_sqs_processor: Modifications complete after 7s [id=UserListSearch-Dev-EventHandler]
aws_lambda_function.item_update_sqs_processor: Modifications complete after 9s [id=UserListSearch-Dev-ItemUpdate]
aws_lambda_function.user_list_import_backfill_sqs_processor: Modifications complete after 9s [id=UserListSearch-Dev-UserListImportBackfill]
aws_lambda_function.user_list_import_sqs_processor: Modifications complete after 9s [id=UserListSearch-Dev-UserListImport]
aws_lambda_function.item_delete_sqs_processor: Modifications complete after 9s [id=UserListSearch-Dev-ItemDelete]
aws_lambda_function.unified_events_consumer: Modifications complete after 9s [id=UserListSearch-Dev-UnifiedEventsConsumer]
aws_lambda_function.item_update_backfill_sqs_processor: Still modifying... [id=UserListSearch-Dev-ItemUpdateBackfill, 10s elapsed]
aws_lambda_function.item_update_backfill_sqs_processor: Modifications complete after 12s [id=UserListSearch-Dev-ItemUpdateBackfill]

Apply complete! Resources: 1 added, 7 changed, 0 destroyed.

Outputs:

workspace = "UserListSearch-Dev"

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"2d341427-df52-4fd2-b409-b9b02235e271","JobName":"user-list-search_infrastructure_apply_dev","PRNumber":156,"Program":"tfcmt","SHA1":"feecb7d5169a1cbcb2e9811d077e9404729156d4","Target":"user-list-search-cdk-dev","Vars":{}} -->